[
  {
    "title": "DAO Member Engagement - Best Practices and Tools",
    "excerpt": "Decentralized Autonomous Organizations (DAOs) represent a revolutionary approach to collaborative decision-making and resource...",
    "url": "/blog/html/dao-member-engagement-post.html",
    "date": "2025-01-03T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "CRM Strategies for DeFi Lending Platforms",
    "excerpt": "The decentralized finance (DeFi) lending ecosystem is rapidly evolving, presenting unique challenges and opportunities for...",
    "url": "/blog/html/defi-lending-crm-post.html",
    "date": "2025-01-05T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "The Future of Loyalty Programs",
    "excerpt": "The loyalty program landscape is undergoing a revolutionary transformation. Traditional points-based systems, plastic cards...",
    "url": "/blog/html/future-of-loyalty-programs.html",
    "date": "2025-01-07T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "Introduction to AI CRM - Bridging Web3 and Customer Engagement",
    "excerpt": "The convergence of artificial intelligence and blockchain technology is revolutionizing how businesses interact with their customers...",
    "url": "/blog/html/intro-to-ai-crm.html",
    "date": "2025-01-09T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "Introduction to CRM - Beyond Traditional Customer Management",
    "excerpt": "In today's rapidly evolving digital landscape, Customer Relationship Management (CRM) has transformed from a simple contact...",
    "url": "/blog/html/intro-to-crm.html",
    "date": "2025-01-11T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "Comparing Loyalty Program Approaches - Centralized vs. Decentralized",
    "excerpt": "Loyalty programs have long been a staple of customer retention strategies across industries. However, the traditional...",
    "url": "/blog/html/loyalty-programs-comparison.html",
    "date": "2025-01-13T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "Multi-Chain Support - The Backbone of Modern Web3 CRM Systems",
    "excerpt": "In the rapidly evolving landscape of Web3 technologies, multi-chain support has emerged as a critical feature for Customer...",
    "url": "/blog/html/multi-chain-crm-post.html",
    "date": "2025-01-15T00:00:00.000Z",
    "author": "Veil CRM Team"
  },
  {
    "title": "AI-Enhanced Blockchain CRM for Onboarding and Customer Engagement in Web3",
    "excerpt": "The rapid adoption of Web3 technologies has introduced complex barriers for non-technical users entering the crypto ecosystem...",
    "url": "/blog/html/veil-crm-whitepaper.html",
    "date": "2025-01-01T00:00:00.000Z",
    "author": "Veil CRM Team"
  }
]